app/controllers/model_controller.rb

SELECT "categories".* FROM "categories"
---
  def new
    @post = params
    @categories = Category.all

INSERT INTO "models" ("category_1", "category_2", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["category_1", 1], ["category_2", 2], ["created_at", Fri, 06 Sep 2013 23:44:14 UTC +00:00], ["updated_at", Fri, 06 Sep 2013 23:44:14 UTC +00:00]]
---
  def create
    modelParams=params["model"]
    modelParams[:rating] = 0.0
    modelParams[:creator] = current_user.id

    # Create a new model based on the passed in parameters.
    @model = Model.new(modelParams)

    # Save the model to the database.
    # TODO: Add check to make sure model was saved.
    @model.save

SELECT "models".* FROM "models" WHERE "models"."id" = ? LIMIT 1  [["id", "new_details"]]
---
  def show
    @otherModels = []

    @post = params

    @model = Model.find(params[:id]) rescue render_404